---
custom_edit_url: https://github.com/langchain-ai/langchain/edit/master/docs/docs/how_to/graph_prompting.ipynb
sidebar_position: 2
---
# å¦‚ä½•æœ€ä½³æç¤º Graph-RAG

åœ¨æœ¬æŒ‡å—ä¸­ï¼Œæˆ‘ä»¬å°†è®¨è®ºæç¤ºç­–ç•¥ï¼Œä»¥æ”¹å–„å›¾æ•°æ®åº“æŸ¥è¯¢ç”Ÿæˆã€‚æˆ‘ä»¬å°†ä¸»è¦å…³æ³¨è·å–ä¸æ•°æ®åº“ç›¸å…³çš„ä¿¡æ¯çš„æ–¹æ³•ã€‚

## è®¾ç½®

é¦–å…ˆï¼Œè·å–æ‰€éœ€çš„åŒ…å¹¶è®¾ç½®ç¯å¢ƒå˜é‡ï¼š


```python
%pip install --upgrade --quiet  langchain langchain-community langchain-openai neo4j
```
```output
Note: you may need to restart the kernel to use updated packages.
```
åœ¨æœ¬æŒ‡å—ä¸­ï¼Œæˆ‘ä»¬é»˜è®¤ä½¿ç”¨OpenAIæ¨¡å‹ï¼Œä½†æ‚¨å¯ä»¥å°†å…¶æ›´æ¢ä¸ºæ‚¨é€‰æ‹©çš„å¤§æ¨¡å‹ä¾›åº”å•†ã€‚


```python
import getpass
import os

os.environ["OPENAI_API_KEY"] = getpass.getpass()

# Uncomment the below to use LangSmith. Not required.
# os.environ["LANGCHAIN_API_KEY"] = getpass.getpass()
# os.environ["LANGCHAIN_TRACING_V2"] = "true"
```
```output
 Â·Â·Â·Â·Â·Â·Â·Â·
```
æ¥ä¸‹æ¥ï¼Œæˆ‘ä»¬éœ€è¦å®šä¹‰Neo4jå‡­æ®ã€‚
è¯·æŒ‰ç…§[è¿™äº›å®‰è£…æ­¥éª¤](https://neo4j.com/docs/operations-manual/current/installation/)è®¾ç½®Neo4jæ•°æ®åº“ã€‚


```python
os.environ["NEO4J_URI"] = "bolt://localhost:7687"
os.environ["NEO4J_USERNAME"] = "neo4j"
os.environ["NEO4J_PASSWORD"] = "password"
```

ä¸‹é¢çš„ç¤ºä¾‹å°†åˆ›å»ºä¸Neo4jæ•°æ®åº“çš„è¿æ¥ï¼Œå¹¶ç”¨å…³äºç”µå½±åŠå…¶æ¼”å‘˜çš„ç¤ºä¾‹æ•°æ®å¡«å……å®ƒã€‚


```python
<!--IMPORTS:[{"imported": "Neo4jGraph", "source": "langchain_community.graphs", "docs": "https://python.langchain.com/api_reference/community/graphs/langchain_community.graphs.neo4j_graph.Neo4jGraph.html", "title": "How to best prompt for Graph-RAG"}]-->
from langchain_community.graphs import Neo4jGraph

graph = Neo4jGraph()

# Import movie information

movies_query = """
LOAD CSV WITH HEADERS FROM 
'https://raw.githubusercontent.com/tomasonjo/blog-datasets/main/movies/movies_small.csv'
AS row
MERGE (m:Movie {id:row.movieId})
SET m.released = date(row.released),
    m.title = row.title,
    m.imdbRating = toFloat(row.imdbRating)
FOREACH (director in split(row.director, '|') | 
    MERGE (p:Person {name:trim(director)})
    MERGE (p)-[:DIRECTED]->(m))
FOREACH (actor in split(row.actors, '|') | 
    MERGE (p:Person {name:trim(actor)})
    MERGE (p)-[:ACTED_IN]->(m))
FOREACH (genre in split(row.genres, '|') | 
    MERGE (g:Genre {name:trim(genre)})
    MERGE (m)-[:IN_GENRE]->(g))
"""

graph.query(movies_query)
```



```output
[]
```


# è¿‡æ»¤å›¾æ¨¡å¼

æœ‰æ—¶ï¼Œæ‚¨å¯èƒ½éœ€è¦åœ¨ç”ŸæˆCypherè¯­å¥æ—¶ä¸“æ³¨äºå›¾æ¨¡å¼çš„ç‰¹å®šå­é›†ã€‚
å‡è®¾æˆ‘ä»¬æ­£åœ¨å¤„ç†ä»¥ä¸‹å›¾æ¨¡å¼ï¼š


```python
graph.refresh_schema()
print(graph.schema)
```
```output
Node properties are the following:
Movie {imdbRating: FLOAT, id: STRING, released: DATE, title: STRING},Person {name: STRING},Genre {name: STRING}
Relationship properties are the following:

The relationships are the following:
(:Movie)-[:IN_GENRE]->(:Genre),(:Person)-[:DIRECTED]->(:Movie),(:Person)-[:ACTED_IN]->(:Movie)
```
å‡è®¾æˆ‘ä»¬æƒ³è¦ä»ä¼ é€’ç»™å¤§å‹è¯­è¨€æ¨¡å‹çš„æ¨¡å¼è¡¨ç¤ºä¸­æ’é™¤_Genre_èŠ‚ç‚¹ã€‚
æˆ‘ä»¬å¯ä»¥ä½¿ç”¨GraphCypherQAChainé“¾çš„`exclude`å‚æ•°æ¥å®ç°è¿™ä¸€ç‚¹ã€‚


```python
<!--IMPORTS:[{"imported": "GraphCypherQAChain", "source": "langchain.chains", "docs": "https://python.langchain.com/api_reference/community/chains/langchain_community.chains.graph_qa.cypher.GraphCypherQAChain.html", "title": "How to best prompt for Graph-RAG"}, {"imported": "ChatOpenAI", "source": "langchain_openai", "docs": "https://python.langchain.com/api_reference/openai/chat_models/langchain_openai.chat_models.base.ChatOpenAI.html", "title": "How to best prompt for Graph-RAG"}]-->
from langchain.chains import GraphCypherQAChain
from langchain_openai import ChatOpenAI

llm = ChatOpenAI(model="gpt-3.5-turbo", temperature=0)
chain = GraphCypherQAChain.from_llm(
    graph=graph, llm=llm, exclude_types=["Genre"], verbose=True
)
```


```python
print(chain.graph_schema)
```
```output
Node properties are the following:
Movie {imdbRating: FLOAT, id: STRING, released: DATE, title: STRING},Person {name: STRING}
Relationship properties are the following:

The relationships are the following:
(:Person)-[:DIRECTED]->(:Movie),(:Person)-[:ACTED_IN]->(:Movie)
```
## å°‘é‡ç¤ºä¾‹

åœ¨æç¤ºä¸­åŒ…å«è‡ªç„¶è¯­è¨€é—®é¢˜è½¬æ¢ä¸ºæœ‰æ•ˆCypheræŸ¥è¯¢çš„ç¤ºä¾‹ï¼Œé€šå¸¸ä¼šæé«˜æ¨¡å‹æ€§èƒ½ï¼Œå°¤å…¶æ˜¯å¯¹äºå¤æ‚æŸ¥è¯¢ã€‚

å‡è®¾æˆ‘ä»¬æœ‰ä»¥ä¸‹ç¤ºä¾‹ï¼š


```python
examples = [
    {
        "question": "How many artists are there?",
        "query": "MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)",
    },
    {
        "question": "Which actors played in the movie Casino?",
        "query": "MATCH (m:Movie {{title: 'Casino'}})<-[:ACTED_IN]-(a) RETURN a.name",
    },
    {
        "question": "How many movies has Tom Hanks acted in?",
        "query": "MATCH (a:Person {{name: 'Tom Hanks'}})-[:ACTED_IN]->(m:Movie) RETURN count(m)",
    },
    {
        "question": "List all the genres of the movie Schindler's List",
        "query": "MATCH (m:Movie {{title: 'Schindler\\'s List'}})-[:IN_GENRE]->(g:Genre) RETURN g.name",
    },
    {
        "question": "Which actors have worked in movies from both the comedy and action genres?",
        "query": "MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g1:Genre), (a)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g1.name = 'Comedy' AND g2.name = 'Action' RETURN DISTINCT a.name",
    },
    {
        "question": "Which directors have made movies with at least three different actors named 'John'?",
        "query": "MATCH (d:Person)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Person) WHERE a.name STARTS WITH 'John' WITH d, COUNT(DISTINCT a) AS JohnsCount WHERE JohnsCount >= 3 RETURN d.name",
    },
    {
        "question": "Identify movies where directors also played a role in the film.",
        "query": "MATCH (p:Person)-[:DIRECTED]->(m:Movie), (p)-[:ACTED_IN]->(m) RETURN m.title, p.name",
    },
    {
        "question": "Find the actor with the highest number of movies in the database.",
        "query": "MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) RETURN a.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 1",
    },
]
```

æˆ‘ä»¬å¯ä»¥åƒè¿™æ ·åˆ›å»ºä¸€ä¸ªå°‘é‡ç¤ºä¾‹æç¤ºï¼š


```python
<!--IMPORTS:[{"imported": "FewShotPromptTemplate", "source": "langchain_core.prompts", "docs": "https://python.langchain.com/api_reference/core/prompts/langchain_core.prompts.few_shot.FewShotPromptTemplate.html", "title": "How to best prompt for Graph-RAG"}, {"imported": "PromptTemplate", "source": "langchain_core.prompts", "docs": "https://python.langchain.com/api_reference/core/prompts/langchain_core.prompts.prompt.PromptTemplate.html", "title": "How to best prompt for Graph-RAG"}]-->
from langchain_core.prompts import FewShotPromptTemplate, PromptTemplate

example_prompt = PromptTemplate.from_template(
    "User input: {question}\nCypher query: {query}"
)
prompt = FewShotPromptTemplate(
    examples=examples[:5],
    example_prompt=example_prompt,
    prefix="You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\n\nHere is the schema information\n{schema}.\n\nBelow are a number of examples of questions and their corresponding Cypher queries.",
    suffix="User input: {question}\nCypher query: ",
    input_variables=["question", "schema"],
)
```


```python
print(prompt.format(question="How many artists are there?", schema="foo"))
```
```output
You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.

Here is the schema information
foo.

Below are a number of examples of questions and their corresponding Cypher queries.

User input: How many artists are there?
Cypher query: MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)

User input: Which actors played in the movie Casino?
Cypher query: MATCH (m:Movie {title: 'Casino'})<-[:ACTED_IN]-(a) RETURN a.name

User input: How many movies has Tom Hanks acted in?
Cypher query: MATCH (a:Person {name: 'Tom Hanks'})-[:ACTED_IN]->(m:Movie) RETURN count(m)

User input: List all the genres of the movie Schindler's List
Cypher query: MATCH (m:Movie {title: 'Schindler\'s List'})-[:IN_GENRE]->(g:Genre) RETURN g.name

User input: Which actors have worked in movies from both the comedy and action genres?
Cypher query: MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g1:Genre), (a)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g1.name = 'Comedy' AND g2.name = 'Action' RETURN DISTINCT a.name

User input: How many artists are there?
Cypher query:
```
## åŠ¨æ€å°‘é‡ç¤ºä¾‹

å¦‚æœæˆ‘ä»¬æœ‰è¶³å¤Ÿçš„ç¤ºä¾‹ï¼Œæˆ‘ä»¬å¯èƒ½åªæƒ³åœ¨æç¤ºä¸­åŒ…å«æœ€ç›¸å…³çš„ç¤ºä¾‹ï¼Œæˆ–è€…å› ä¸ºå®ƒä»¬ä¸é€‚åˆæ¨¡å‹çš„ä¸Šä¸‹æ–‡çª—å£ï¼Œæˆ–è€…å› ä¸ºé•¿å°¾ç¤ºä¾‹ä¼šåˆ†æ•£æ¨¡å‹çš„æ³¨æ„åŠ›ã€‚å…·ä½“æ¥è¯´ï¼Œç»™å®šä»»ä½•è¾“å…¥ï¼Œæˆ‘ä»¬å¸Œæœ›åŒ…å«ä¸è¯¥è¾“å…¥æœ€ç›¸å…³çš„ç¤ºä¾‹ã€‚

æˆ‘ä»¬å¯ä»¥ä½¿ç”¨ç¤ºä¾‹é€‰æ‹©å™¨æ¥å®ç°è¿™ä¸€ç‚¹ã€‚åœ¨è¿™ç§æƒ…å†µä¸‹ï¼Œæˆ‘ä»¬å°†ä½¿ç”¨[è¯­ä¹‰ç›¸ä¼¼æ€§ç¤ºä¾‹é€‰æ‹©å™¨](https://python.langchain.com/api_reference/core/example_selectors/langchain_core.example_selectors.semantic_similarity.SemanticSimilarityExampleSelector.html)ï¼Œå®ƒå°†æŠŠç¤ºä¾‹å­˜å‚¨åœ¨æˆ‘ä»¬é€‰æ‹©çš„å‘é‡æ•°æ®åº“ä¸­ã€‚åœ¨è¿è¡Œæ—¶ï¼Œå®ƒå°†æ‰§è¡Œè¾“å…¥ä¸æˆ‘ä»¬çš„ç¤ºä¾‹ä¹‹é—´çš„ç›¸ä¼¼æ€§æœç´¢ï¼Œå¹¶è¿”å›æœ€è¯­ä¹‰ç›¸ä¼¼çš„ç¤ºä¾‹ï¼š


```python
<!--IMPORTS:[{"imported": "Neo4jVector", "source": "langchain_community.vectorstores", "docs": "https://python.langchain.com/api_reference/community/vectorstores/langchain_community.vectorstores.neo4j_vector.Neo4jVector.html", "title": "How to best prompt for Graph-RAG"}, {"imported": "SemanticSimilarityExampleSelector", "source": "langchain_core.example_selectors", "docs": "https://python.langchain.com/api_reference/core/example_selectors/langchain_core.example_selectors.semantic_similarity.SemanticSimilarityExampleSelector.html", "title": "How to best prompt for Graph-RAG"}, {"imported": "OpenAIEmbeddings", "source": "langchain_openai", "docs": "https://python.langchain.com/api_reference/openai/embeddings/langchain_openai.embeddings.base.OpenAIEmbeddings.html", "title": "How to best prompt for Graph-RAG"}]-->
from langchain_community.vectorstores import Neo4jVector
from langchain_core.example_selectors import SemanticSimilarityExampleSelector
from langchain_openai import OpenAIEmbeddings

example_selector = SemanticSimilarityExampleSelector.from_examples(
    examples,
    OpenAIEmbeddings(),
    Neo4jVector,
    k=5,
    input_keys=["question"],
)
```


```python
example_selector.select_examples({"question": "how many artists are there?"})
```



```output
[{'query': 'MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)',
  'question': 'How many artists are there?'},
 {'query': "MATCH (a:Person {{name: 'Tom Hanks'}})-[:ACTED_IN]->(m:Movie) RETURN count(m)",
  'question': 'How many movies has Tom Hanks acted in?'},
 {'query': "MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g1:Genre), (a)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g1.name = 'Comedy' AND g2.name = 'Action' RETURN DISTINCT a.name",
  'question': 'Which actors have worked in movies from both the comedy and action genres?'},
 {'query': "MATCH (d:Person)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Person) WHERE a.name STARTS WITH 'John' WITH d, COUNT(DISTINCT a) AS JohnsCount WHERE JohnsCount >= 3 RETURN d.name",
  'question': "Which directors have made movies with at least three different actors named 'John'?"},
 {'query': 'MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) RETURN a.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 1',
  'question': 'Find the actor with the highest number of movies in the database.'}]
```


è¦ä½¿ç”¨å®ƒï¼Œæˆ‘ä»¬å¯ä»¥ç›´æ¥å°†ç¤ºä¾‹é€‰æ‹©å™¨ä¼ é€’ç»™æˆ‘ä»¬çš„å°‘é‡ç¤ºä¾‹æç¤ºæ¨¡æ¿ï¼š


```python
prompt = FewShotPromptTemplate(
    example_selector=example_selector,
    example_prompt=example_prompt,
    prefix="You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\n\nHere is the schema information\n{schema}.\n\nBelow are a number of examples of questions and their corresponding Cypher queries.",
    suffix="User input: {question}\nCypher query: ",
    input_variables=["question", "schema"],
)
```


```python
print(prompt.format(question="how many artists are there?", schema="foo"))
```
```output
You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.

Here is the schema information
foo.

Below are a number of examples of questions and their corresponding Cypher queries.

User input: How many artists are there?
Cypher query: MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)

User input: How many movies has Tom Hanks acted in?
Cypher query: MATCH (a:Person {name: 'Tom Hanks'})-[:ACTED_IN]->(m:Movie) RETURN count(m)

User input: Which actors have worked in movies from both the comedy and action genres?
Cypher query: MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g1:Genre), (a)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g1.name = 'Comedy' AND g2.name = 'Action' RETURN DISTINCT a.name

User input: Which directors have made movies with at least three different actors named 'John'?
Cypher query: MATCH (d:Person)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Person) WHERE a.name STARTS WITH 'John' WITH d, COUNT(DISTINCT a) AS JohnsCount WHERE JohnsCount >= 3 RETURN d.name

User input: Find the actor with the highest number of movies in the database.
Cypher query: MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) RETURN a.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 1

User input: how many artists are there?
Cypher query:
```

```python
llm = ChatOpenAI(model="gpt-3.5-turbo", temperature=0)
chain = GraphCypherQAChain.from_llm(
    graph=graph, llm=llm, cypher_prompt=prompt, verbose=True
)
```


```python
chain.invoke("How many actors are in the graph?")
```
```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)[0m
Full Context:
[32;1m[1;3m[{'count(DISTINCT a)': 967}][0m

[1m> Finished chain.[0m
```


```output
{'query': 'How many actors are in the graph?',
 'result': 'There are 967 actors in the graph.'}
```

