---
custom_edit_url: https://github.com/langchain-ai/langchain/edit/master/docs/docs/integrations/graphs/rdflib_sparql.ipynb
---
# RDFLib

>[RDFLib](https://rdflib.readthedocs.io/) æ˜¯ä¸€ä¸ªçº¯ Python åŒ…ï¼Œç”¨äºå¤„ç† [RDF](https://en.wikipedia.org/wiki/Resource_Description_Framework)ã€‚`RDFLib` åŒ…å«äº†å¤„ç† `RDF` æ‰€éœ€çš„å¤§éƒ¨åˆ†å†…å®¹ï¼ŒåŒ…æ‹¬ï¼š
>- RDF/XMLã€N3ã€NTriplesã€N-Quadsã€Turtleã€TriXã€Trig å’Œ JSON-LD çš„è§£æå™¨å’Œåºåˆ—åŒ–å™¨
>- ä¸€ä¸ªå›¾å½¢æ¥å£ï¼Œå¯ä»¥ç”±å¤šç§å­˜å‚¨å®ç°æ”¯æŒ
>- å†…å­˜å­˜å‚¨ã€æŒä¹…åŒ–ç£ç›˜å­˜å‚¨ï¼ˆBerkeley DBï¼‰å’Œè¿œç¨‹ SPARQL ç«¯ç‚¹çš„å­˜å‚¨å®ç°
>- SPARQL 1.1 å®ç° - æ”¯æŒ SPARQL 1.1 æŸ¥è¯¢å’Œæ›´æ–°è¯­å¥
>- SPARQL å‡½æ•°æ‰©å±•æœºåˆ¶

å›¾å½¢æ•°æ®åº“æ˜¯åŸºäºç½‘ç»œæ¨¡å‹çš„åº”ç”¨ç¨‹åºçš„ä¼˜ç§€é€‰æ‹©ã€‚ä¸ºäº†æ ‡å‡†åŒ–æ­¤ç±»å›¾å½¢çš„è¯­æ³•å’Œè¯­ä¹‰ï¼ŒW3C æ¨è `è¯­ä¹‰ç½‘æŠ€æœ¯`ï¼Œå‚è§ [è¯­ä¹‰ç½‘](https://www.w3.org/standards/semanticweb/)ã€‚

[SPARQL](https://www.w3.org/TR/sparql11-query/) ä½œä¸ºæŸ¥è¯¢è¯­è¨€ï¼Œç±»ä¼¼äºè¿™äº›å›¾å½¢çš„ `SQL` æˆ– `Cypher`ã€‚æœ¬ç¬”è®°æœ¬æ¼”ç¤ºäº† LLM ä½œä¸ºå›¾å½¢æ•°æ®åº“çš„è‡ªç„¶è¯­è¨€æ¥å£ï¼Œé€šè¿‡ç”Ÿæˆ `SPARQL`ã€‚

**å…è´£å£°æ˜ï¼š** åˆ°ç›®å‰ä¸ºæ­¢ï¼Œé€šè¿‡ LLM ç”Ÿæˆ `SPARQL` æŸ¥è¯¢ä»ç„¶æœ‰äº›ä¸ç¨³å®šã€‚ç‰¹åˆ«æ³¨æ„ `UPDATE` æŸ¥è¯¢ï¼Œè¿™ä¼šæ”¹å˜å›¾å½¢ã€‚

## è®¾ç½®

æˆ‘ä»¬éœ€è¦å®‰è£…ä¸€ä¸ªPythonåº“ï¼š


```python
!pip install rdflib
```

æ‚¨å¯ä»¥é’ˆå¯¹å¤šä¸ªæ¥æºè¿è¡ŒæŸ¥è¯¢ï¼ŒåŒ…æ‹¬ç½‘ç»œä¸Šçš„æ–‡ä»¶ã€æ‚¨æœ¬åœ°å¯ç”¨çš„æ–‡ä»¶ã€SPARQL ç«¯ç‚¹ï¼Œä¾‹å¦‚ [Wikidata](https://www.wikidata.org/wiki/Wikidata:Main_Page) å’Œ [ä¸‰å…ƒç»„å­˜å‚¨](https://www.w3.org/wiki/LargeTripleStores)ã€‚


```python
<!--IMPORTS:[{"imported": "GraphSparqlQAChain", "source": "langchain.chains", "docs": "https://python.langchain.com/api_reference/community/chains/langchain_community.chains.graph_qa.sparql.GraphSparqlQAChain.html", "title": "RDFLib"}, {"imported": "RdfGraph", "source": "langchain_community.graphs", "docs": "https://python.langchain.com/api_reference/community/graphs/langchain_community.graphs.rdf_graph.RdfGraph.html", "title": "RDFLib"}, {"imported": "ChatOpenAI", "source": "langchain_openai", "docs": "https://python.langchain.com/api_reference/openai/chat_models/langchain_openai.chat_models.base.ChatOpenAI.html", "title": "RDFLib"}]-->
from langchain.chains import GraphSparqlQAChain
from langchain_community.graphs import RdfGraph
from langchain_openai import ChatOpenAI
```


```python
graph = RdfGraph(
    source_file="http://www.w3.org/People/Berners-Lee/card",
    standard="rdf",
    local_copy="test.ttl",
)
```

è¯·æ³¨æ„ï¼Œå¦‚æœæºæ˜¯åªè¯»çš„ï¼Œæä¾› `local_file` æ˜¯åœ¨æœ¬åœ°å­˜å‚¨æ›´æ”¹æ‰€å¿…éœ€çš„ã€‚

## åˆ·æ–°å›¾å½¢æ¨¡å¼ä¿¡æ¯
å¦‚æœæ•°æ®åº“çš„æ¨¡å¼å‘ç”Ÿå˜åŒ–ï¼Œæ‚¨å¯ä»¥åˆ·æ–°ç”Ÿæˆ SPARQL æŸ¥è¯¢æ‰€éœ€çš„æ¨¡å¼ä¿¡æ¯ã€‚


```python
graph.load_schema()
```


```python
graph.get_schema
```
```output
In the following, each IRI is followed by the local name and optionally its description in parentheses. 
The RDF graph supports the following node types:
<http://xmlns.com/foaf/0.1/PersonalProfileDocument> (PersonalProfileDocument, None), <http://www.w3.org/ns/auth/cert#RSAPublicKey> (RSAPublicKey, None), <http://www.w3.org/2000/10/swap/pim/contact#Male> (Male, None), <http://xmlns.com/foaf/0.1/Person> (Person, None), <http://www.w3.org/2006/vcard/ns#Work> (Work, None)
The RDF graph supports the following relationships:
<http://www.w3.org/2000/01/rdf-schema#seeAlso> (seeAlso, None), <http://purl.org/dc/elements/1.1/title> (title, None), <http://xmlns.com/foaf/0.1/mbox_sha1sum> (mbox_sha1sum, None), <http://xmlns.com/foaf/0.1/maker> (maker, None), <http://www.w3.org/ns/solid/terms#oidcIssuer> (oidcIssuer, None), <http://www.w3.org/2000/10/swap/pim/contact#publicHomePage> (publicHomePage, None), <http://xmlns.com/foaf/0.1/openid> (openid, None), <http://www.w3.org/ns/pim/space#storage> (storage, None), <http://xmlns.com/foaf/0.1/name> (name, None), <http://www.w3.org/2000/10/swap/pim/contact#country> (country, None), <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> (type, None), <http://www.w3.org/ns/solid/terms#profileHighlightColor> (profileHighlightColor, None), <http://www.w3.org/ns/pim/space#preferencesFile> (preferencesFile, None), <http://www.w3.org/2000/01/rdf-schema#label> (label, None), <http://www.w3.org/ns/auth/cert#modulus> (modulus, None), <http://www.w3.org/2000/10/swap/pim/contact#participant> (participant, None), <http://www.w3.org/2000/10/swap/pim/contact#street2> (street2, None), <http://www.w3.org/2006/vcard/ns#locality> (locality, None), <http://xmlns.com/foaf/0.1/nick> (nick, None), <http://xmlns.com/foaf/0.1/homepage> (homepage, None), <http://creativecommons.org/ns#license> (license, None), <http://xmlns.com/foaf/0.1/givenname> (givenname, None), <http://www.w3.org/2006/vcard/ns#street-address> (street-address, None), <http://www.w3.org/2006/vcard/ns#postal-code> (postal-code, None), <http://www.w3.org/2000/10/swap/pim/contact#street> (street, None), <http://www.w3.org/2003/01/geo/wgs84_pos#lat> (lat, None), <http://xmlns.com/foaf/0.1/primaryTopic> (primaryTopic, None), <http://www.w3.org/2006/vcard/ns#fn> (fn, None), <http://www.w3.org/2003/01/geo/wgs84_pos#location> (location, None), <http://usefulinc.com/ns/doap#developer> (developer, None), <http://www.w3.org/2000/10/swap/pim/contact#city> (city, None), <http://www.w3.org/2006/vcard/ns#region> (region, None), <http://xmlns.com/foaf/0.1/member> (member, None), <http://www.w3.org/2003/01/geo/wgs84_pos#long> (long, None), <http://www.w3.org/2000/10/swap/pim/contact#address> (address, None), <http://xmlns.com/foaf/0.1/family_name> (family_name, None), <http://xmlns.com/foaf/0.1/account> (account, None), <http://xmlns.com/foaf/0.1/workplaceHomepage> (workplaceHomepage, None), <http://purl.org/dc/terms/title> (title, None), <http://www.w3.org/ns/solid/terms#publicTypeIndex> (publicTypeIndex, None), <http://www.w3.org/2000/10/swap/pim/contact#office> (office, None), <http://www.w3.org/2000/10/swap/pim/contact#homePage> (homePage, None), <http://xmlns.com/foaf/0.1/mbox> (mbox, None), <http://www.w3.org/2000/10/swap/pim/contact#preferredURI> (preferredURI, None), <http://www.w3.org/ns/solid/terms#profileBackgroundColor> (profileBackgroundColor, None), <http://schema.org/owns> (owns, None), <http://xmlns.com/foaf/0.1/based_near> (based_near, None), <http://www.w3.org/2006/vcard/ns#hasAddress> (hasAddress, None), <http://xmlns.com/foaf/0.1/img> (img, None), <http://www.w3.org/2000/10/swap/pim/contact#assistant> (assistant, None), <http://xmlns.com/foaf/0.1/title> (title, None), <http://www.w3.org/ns/auth/cert#key> (key, None), <http://www.w3.org/ns/ldp#inbox> (inbox, None), <http://www.w3.org/ns/solid/terms#editableProfile> (editableProfile, None), <http://www.w3.org/2000/10/swap/pim/contact#postalCode> (postalCode, None), <http://xmlns.com/foaf/0.1/weblog> (weblog, None), <http://www.w3.org/ns/auth/cert#exponent> (exponent, None), <http://rdfs.org/sioc/ns#avatar> (avatar, None)
```
## æŸ¥è¯¢å›¾å½¢

ç°åœ¨ï¼Œæ‚¨å¯ä»¥ä½¿ç”¨å›¾å½¢ SPARQL QA é“¾æ¥è¯¢é—®æœ‰å…³å›¾å½¢çš„é—®é¢˜ã€‚


```python
chain = GraphSparqlQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True
)
```


```python
chain.run("What is Tim Berners-Lee's work homepage?")
```
```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mSELECT[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?homepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?homepage .
}[0m
Full Context:
[32;1m[1;3m[][0m

[1m> Finished chain.[0m
```


```output
"Tim Berners-Lee's work homepage is http://www.w3.org/People/Berners-Lee/."
```


## æ›´æ–°å›¾å½¢

ç±»ä¼¼åœ°ï¼Œæ‚¨å¯ä»¥ä½¿ç”¨è‡ªç„¶è¯­è¨€æ›´æ–°å›¾å½¢ï¼Œå³æ’å…¥ä¸‰å…ƒç»„ã€‚


```python
chain.run(
    "Save that the person with the name 'Timothy Berners-Lee' has a work homepage at 'http://www.w3.org/foo/bar/'"
)
```
```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mUPDATE[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
INSERT {
    ?person foaf:workplaceHomepage <http://www.w3.org/foo/bar/> .
}
WHERE {
    ?person foaf:name "Timothy Berners-Lee" .
}[0m

[1m> Finished chain.[0m
```


```output
'Successfully inserted triples into the graph.'
```


è®©æˆ‘ä»¬éªŒè¯ç»“æœï¼š


```python
query = (
    """PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n"""
    """SELECT ?hp\n"""
    """WHERE {\n"""
    """    ?person foaf:name "Timothy Berners-Lee" . \n"""
    """    ?person foaf:workplaceHomepage ?hp .\n"""
    """}"""
)
graph.query(query)
```



```output
[(rdflib.term.URIRef('https://www.w3.org/'),),
 (rdflib.term.URIRef('http://www.w3.org/foo/bar/'),)]
```


## è¿”å› SPARQL æŸ¥è¯¢
æ‚¨å¯ä»¥ä½¿ç”¨ `return_sparql_query` å‚æ•°ä» Sparql QA Chain è¿”å› SPARQL æŸ¥è¯¢æ­¥éª¤


```python
chain = GraphSparqlQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_sparql_query=True
)
```


```python
result = chain("What is Tim Berners-Lee's work homepage?")
print(f"SPARQL query: {result['sparql_query']}")
print(f"Final answer: {result['result']}")
```
```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mSELECT[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}[0m
Full Context:
[32;1m[1;3m[][0m

[1m> Finished chain.[0m
SPARQL query: PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}
Final answer: Tim Berners-Lee's work homepage is http://www.w3.org/People/Berners-Lee/.
```

```python
print(result["sparql_query"])
```
```output
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}
```